[
  {
    "title": "Quiz Me",
    "image": "./projectImages/quizme.png",
    "description": "Quiz Me is a web-based application and Telegram bot that harnesses the power of generative AI to transform educational materials into engaging and interactive quizzes. It not only converts the content but also tracks students' progress and delivers personalized learning experiences. Additionally, Quiz Me supports competitive learning by enabling users to participate in quizzes and view scoreboards to gauge their performance relative to others.",
    "technologies": "Django | javascript | Bootstrap | HTML",
    "github": "https://github.com/AbdulwahidHusein/A2SVGenerativeAi",
    "deployed": "",
    "bgcolor": "#f37737",
    "id": "1"
  },
  {
    "title": "Weather",
    "image": "./projectImages/weather.png",
    "technologies": "jQuery | HTML | CSS",
    "description": " This dashboard uses the OpenWeatherMap API to retrieve detailed weather data, including the city name, date, weather icon, temperature, humidity, and wind speed. The dashboard has a 5-day forecast feature and a search history feature that saves past searches for easy access. It also has a dark/light theme that changes the look of the page based on day or night in the searched location and uses the geolocation API to automatically determine the user's current location and display the weather.",
    "github": "https://github.com/AbdulwahidHusein/weather-app-main",
    "deployed": "https://abdulwahidhusein.github.io/weather-app-main/",
    "bgcolor": "#29cbe0",
    "id": "2"
  },
  {
    "title": "YouTube Clone",
    "image": "./projectImages/youtubeclone.png",
    "technologies": "React | Bootstrap | Rapid API| Material UI",
    "description": "This project effectively utilizes the Rapid API to fetch YouTube videos, while being built using the ReactJS framework and Material UI. The integration of Rapid API seamlessly facilitates the retrieval and fetching of YouTube videos, enhancing the project's functionality and versatility. Developed with ReactJS, the project benefits from its dynamic content updates and efficient rendering, ensuring a smooth and interactive video browsing experience. The implementation of Material UI adds a touch of elegance and visual appeal to the project, with its sleek design and responsive layout.",
    "github": "https://github.com/AbdulwahidHussien/YoutubeClone",
    "deployed": "https://symphonious-babka-1c4d6c.netlify.app/",
    "bgcolor": "#6c4bf4",
    "id": "3"
  },
  {
    "title": "ShopWise",
    "image": "",
    "technologies": "Django | React | Django Rest Framework",
    "description": "Shopwise is an ecommerce Platfom built using React and Django. it makes the process of buying and selling products easy for every users.",
    "github": "https://github.com/AbdulwahidHusein/ShopWise",
    "deployed": "",
    "bgcolor": "#f85781",
    "id": "4"
  }
]
